"""
Чат бот для автомтизации работы с клиентами

О моем проекте:
У меня есть небольшой бизнес - школа художественной гимнастики с несколькими отделениями в Москве. 
Ежедневно мне приходится отвечать на звонки и сообщения клиентов, напоминать им об оплате. Хочу автоматизировать эти процессы, для этого мне нужен чат-бот, который сможет записывать потенциальных клиентов на занятия, а также помогать текущим клиентам принимать справки о болезни для перерасчёта стоимости, показывать, сколько оплаченных занятий осталось, присылать ссылки на оплату, отправлять уведомления и т.д.


Алгоритм для проекта
0 часть - Предварительная работа
Создание скрипта вопросов ответов (не код)
1 часть - Разогрев
Создание и подключение созданного бота
	Создать бота
	Подключить бота
Прописывание в виде кода скрипта
	Создание текста
	Привязывание текста к кнопочкам
	Группировка
	Сбор первичных данных о клиенте (ФИО, возраст, желаемый филиал, телефон)
Подгрузка и выдача файлов по запросу (Договор оказания услуг, Политика конфиденциальности)
	Создание списка доступных файлов
	При запросе прикрепить соответствующий файл
2 часть - Работа с клиентом и его данными
Настройка интеграции с Google таблицами
	Подключение к Google таблицам
Сбор информации о клиенте из таблиц
	Создание класса "клиент"
	Вытаскивание информации из таблиц
	Заполнение полей клиента на основании этих таблиц
Получение клиентами доступной информации о себе (клиенте) 
	Создание списка доступных просмотров (проведенные платежи, посещенные занятия, кол-во оставшихся занятий)
	Написание фунцкций выдачи этой информации
Генерация ссылок под каждого клиента (запись/оплата)
	Создание списка доступных активных действий (посмотреть расписание, узнать цены, записаться, получить ссылку на оплату)
	Позволить клиентам отправлять файлы (фото справок)
Запись изменений обратно в Google таблицами
	Если это возможно
Уведомление клиентов
	Периодически проверять всех клиентов и отправлять уведомления тем, у кого заканчиваются абонементы
Встраивание активных действий в созданный чат бот в части 1
	
Библиотеки для работы с проектом
python-telegram-bot - работа с телеграм ботом
google-api-python-client google-auth-httplib2 google-auth-oauthlib - работа с google
"""