"""
Михалева Юлия Андреевна
редактируйте/пишите код в блоках между
---начало--- и ---конец---
Решение задачи может быть в несколько строчек, но чем меньше, тем лучше.
В случае верного решения запуск файла приведёт к выводу True для каждого задания
"""
s = 'Михалева Юлия Андреевна'
i = 12

""" +++ ВЛОЖЕННЫЕ СПИСКИ +++ """

""" Задание №1
Создайте пустой список 'fio'
---------------начало блока редактирования----------------"""

fio = []

"""------------ конец блока редактирования----------------"""
print('№1 ' + str(fio == []))

""" Задание №2
Используя цикл for добавьте в 'fio' список букв вашей фамилии, список букв вашего имени и список букв вашего отчества
---------------начало блока редактирования----------------"""

for elem in s.split(" "):
    fio.append(list(elem))
    
"""------------ конец блока редактирования----------------"""
print('№2 ' + str(fio == [['М', 'и', 'х', 'а', 'л', 'е', 'в', 'а'], ['Ю', 'л', 'и', 'я'], ['А', 'н', 'д', 'р', 'е', 'е', 'в', 'н', 'а']]))

""" Задание №3
Используя цикл while переверните каждый элемент в 'fio' задом наперёд
---------------начало блока редактирования----------------"""

i = 0
while i < len(fio):
    fio[i].reverse()
    i += 1
    
"""------------ конец блока редактирования----------------"""
print('№3 ' + str(fio == [['а', 'в', 'е', 'л', 'а', 'х', 'и', 'М'], ['я', 'и', 'л', 'Ю'], ['а', 'н', 'в', 'е', 'е', 'р', 'д', 'н', 'А']]))

""" Задание №4
Получите из переменной fio 1-ю букву вашего имени и запишите её в в переменной 'char'
---------------начало блока редактирования----------------"""

char = fio[1][-1]

"""------------ конец блока редактирования----------------"""
print('№4 ' + str(char == 'Ю'))

""" Задание №5
Получите из переменной fio 1-ю букву вашего имени и запишите её в в переменной 'char'
---------------начало блока редактирования----------------"""

char = fio[1][-1]

"""------------ конец блока редактирования----------------"""
print('№5 ' + str(char == 'Ю'))

""" Задание №6
Создайте список fio_len и запишите в него длины вашей фамилии, имени и отчества, получив их из fio
---------------начало блока редактирования----------------"""

fio_len = []
for elem in fio:
    fio_len.append(len(elem))
    
"""------------ конец блока редактирования----------------"""
print('№6 ' + str(fio_len == [8, 4, 9]))

""" Задание №7
Используя стандартную функцию min получите длину самого короткого слова из ваших ФИО
---------------начало блока редактирования----------------"""

min_len = min(fio_len)

"""------------ конец блока редактирования----------------"""
print('№7 ' + str(min_len == 4))

""" Задание №8
Используя цикл в цикле получите строку, в которой будет:
последняя буква вашей фамилии, затем имени, затем отчества,
затем предпоследния буква вашей фамилии, имени, отчества,
затем предпредпоследния буква вашей фамилии, имени, отчества,
и так до того момента, пока не закончатся символы в самом коротком слове из вашей ФИО
---------------начало блока редактирования----------------"""

chars = ""

for letter_index in range(min_len):
    for fio_index in range(len(fio)):
        chars += fio[fio_index][letter_index]
        
"""------------ конец блока редактирования----------------"""
print('№8 ' + str(chars == 'аяавинелвлЮе'))


""" +++ СЛОВАРИ +++ """

""" Задание №9
Создайте словарь с ключами 'фамилия' 'имя' 'отчество' и соответствующими значениями ФИО задом наперёд
---------------начало блока редактирования----------------"""

reversed_fio_dict = {"фамилия": fio[0]}
reversed_fio_dict["имя"] = fio[1]
reversed_fio_dict["отчество"] = fio[2]

"""------------ конец блока редактирования----------------"""
print('№9 ' + str(reversed_fio_dict == {'фамилия': ['а', 'в', 'е', 'л', 'а', 'х', 'и', 'М'], 'имя': ['я', 'и', 'л', 'Ю'], 'отчество': ['а', 'н', 'в', 'е', 'е', 'р', 'д', 'н', 'А']}))

""" Задание №10
Получите список ключей словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_keys = list(reversed_fio_dict.keys())

"""------------ конец блока редактирования----------------"""
print('№10 ' + str(reversed_fio_dict_keys == ['фамилия', 'имя', 'отчество']))

""" Задание №11
Получите список значений словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_values = list(reversed_fio_dict.values())

"""------------ конец блока редактирования----------------"""
print('№11 ' + str(reversed_fio_dict_values == [['а', 'в', 'е', 'л', 'а', 'х', 'и', 'М'], ['я', 'и', 'л', 'Ю'], ['а', 'н', 'в', 'е', 'е', 'р', 'д', 'н', 'А']]))

""" Задание №12
Получите список картежей, содержащий пары ключ и значение словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_items = list(reversed_fio_dict.items())

"""------------ конец блока редактирования----------------"""
print('№12 ' + str(reversed_fio_dict_items == [('фамилия', ['а', 'в', 'е', 'л', 'а', 'х', 'и', 'М']), ('имя', ['я', 'и', 'л', 'Ю']), ('отчество', ['а', 'н', 'в', 'е', 'е', 'р', 'д', 'н', 'А'])]))

""" Задание №13
Получите значение словаря reversed_fio_dict по ключу фамилия
---------------начало блока редактирования----------------"""

res = reversed_fio_dict["фамилия"]

"""------------ конец блока редактирования----------------"""
print('№13 ' + str(res == ['а', 'в', 'е', 'л', 'а', 'х', 'и', 'М']))

""" Задание №14
Создайте пустой словарь chars
---------------начало блока редактирования----------------"""

chars = {}

"""------------ конец блока редактирования----------------"""
print('№14 ' + str(chars == {}))

""" Задание №15
Преобразуйте строку с вашей ФИО так, чтобы в ней были только маленькие буквы и отсутствовали пробелы
---------------начало блока редактирования----------------"""

s = s.replace(" ", "").lower()

"""------------ конец блока редактирования----------------"""
print('№15 ' + str(s == 'михалеваюлияандреевна'))

""" Задание №16
Пройдите в цикле по всем буквам своих ФИО 's' и сосчитайте количество повторений каждой буквы.
Получите список 'res' из пар (кортежей):
( <буква вашей ФИО>, <количество её появления в вашей ФИО> )
---------------начало блока редактирования----------------"""

res = {}
for i in s:
    res[i] = s.count(i)
res = list(res.items())

"""------------ конец блока редактирования----------------"""
print('№16 ' + str(res == [('м', 1), ('и', 2), ('х', 1), ('а', 4), ('л', 2), ('е', 3), ('в', 2), ('ю', 1), ('я', 1), ('н', 2), ('д', 1), ('р', 1)]))


""" +++ ФУНКЦИИ +++ """

""" Задание №17
Напишите функцию uliaCharToIndex которая:
- получает на вход букву русского алфавита,
- возвращает её номер в алфавите (от 1 до 33).
Например вызов uliaCharToIndex('А') должен возвращать 1
---------------начало блока редактирования----------------"""

def uliaCharToIndex(char):
    char = char.lower()
    if char <= "е": 
        return ord(char) - ord("а") + 1
    elif char == "ё":
        return uliaCharToIndex("е") + 1
    else:
        return ord(char) - ord("а") + 2


"""------------ конец блока редактирования----------------"""
print('№17 ' + str(uliaCharToIndex("У") == 21))

""" Задание №18
При помощи функции uliaCharToIndex измените fio так, чтобы вместо букв, в нём были их номера в алфавите
---------------начало блока редактирования----------------"""

new_fio = []

for elem in fio:
    res = []
    for letter in elem:
        res.append(uliaCharToIndex(letter))
    new_fio.append(res)

fio = new_fio


"""------------ конец блока редактирования----------------"""
print('№18 ' + str(fio == [[1, 3, 6, 13, 1, 23, 10, 14], [33, 10, 13, 32], [1, 15, 3, 6, 6, 18, 5, 15, 1]]))


""" +++ КОНЕЦ =) +++ """
