"""
хотим калькулятор выражений - 2 + 3.5 * 2 - 3 ^ 2
"""

#считать строчку от пользователя

#почистить строку
# "-2 + 3.5 * 2 - 3 ^ 2" -> "-2+3.5*2-3^2"

#распарсить
"""
на вход строку
"-2+3.5*2-2^2"

на выход ? структура данных? с операциями +- и значениями
(+ * - ^)
(-2 3.5 2 3 2)
"""

#вычислить операции первого приоритета (возведение в степень)
"""
на вход наш набор значений и операций
на выход обновленная ? структура данных с операциями +- и значениями

-2+3.5*2-3^2
-2+3.5*2-9
"""

#вычислить операции второго приоритета (умножение и деление)
"""
на вход наш набор значений и операций
на выход обновленная ? структура данных с операциями +- и значениями

-2+3.5*2-9
-2+7-9
"""

#вычислить операции третьего приоритета (сложение и вычитание)
"""
на вход наш набор значений и операций
на выход обновленная ? структура данных с операциями +- и значениями

2+3^2
2+9
"""

